#!/bin/bash
a=(剪刀 石头 布)
read -p "请输入:" aa
b=$[RANDOM%3]
case  ${a[$b]} in
剪刀)
    [ $aa == "剪刀" ] && echo "电脑出的是${a[$b]}平局"
    [ $aa == "石头" ] && echo "电脑出的是${a[$b]}你赢了"   
    [ $aa == "布"  ] && echo "电脑出的是${a[$b]}你输了" ;;  
    
石头)
    [ $aa == "剪刀" ] && echo "电脑出的是${a[$b]}你输了"
    [ $aa == "石头" ] && echo "电脑出的是${a[$b]}平局"   
    [ $aa == "布"  ] && echo "电脑出的是${a[$b]}你赢了" ;;  

布)
    [ $aa == "剪刀" ] && echo "电脑出的是${a[$b]}你赢了"
    [ $aa == "石头" ] && echo "电脑出的是${a[$b]}你输了"   
    [ $aa == "布"  ] && echo "电脑出的是${a[$b]}平局"   ;;

*)
echo "只能输入{剪刀|石头|布}"
esac
